import  React  from  ' react ' ; / ** * SVG 로고를 붙여넣고이 구성 요소에서 반환합니다. * 로고의 높이를 설정했는지 확인하세요. * 높이는 25-35px 이내로 유지하는 것이 좋습니다. * / export default function Logo () {
// import { Icon } from '@types';
   
// const Logo: Icon = ({ fill = "white" }) => {
    return ( 
    <svg
    width="192"
    height="23"
    viewBox="0 0 192 23"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
    className="Logo__Desktop"
  >
    <g clipPath="url(#clip0)">
    <path xmlns="http://www.w3.org/2000/svg" d="M0,0 L43.1807229,0 L43.1807229,135.710843 L0,135.710843 L0,0 Z M246.746988,0 L172.722892,0 L172.722892,43.1807229 L203.566265,43.1807229 L203.566265,135.710843 L246.746988,135.710843 L246.746988,43.1807229 L277.590361,43.1807229 L277.590361,0 L246.746988,0 Z M363.951807,0 L289.927711,0 L289.927711,43.1807229 L320.771084,43.1807229 L320.771084,135.710843 L363.951807,135.710843 L363.951807,43.1807229 L394.795181,43.1807229 L394.795181,0 L363.951807,0 Z M481.156627,0 L407.13253,0 L407.13253,43.1807229 L437.975904,43.1807229 L437.975904,135.710843 L481.156627,135.710843 L481.156627,43.1807229 L512,43.1807229 L512,0 L481.156627,0 Z M160.385542,43.1807229 L160.385542,0 L61.686747,0 L61.686747,135.710843 L104.86747,135.710843 L104.86747,98.6987952 L141.879518,98.6987952 L141.879518,55.5180723 L104.86747,55.5180723 L104.86747,43.1807229 L160.385542,43.1807229 Z" fill={fill} fill-rule="nonzero"/>
    </g>
    <defs>
      <clipPath id="clip0">
        <rect width="191.156" height="23" fill="white" />
      </clipPath>
    </defs>
  </svg>
  ); 
}
// }

// export default Logo;